print("Стандартное квадратное уравнение имеет вид ax^2 + bx + c = 0 ")
a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))
d = b ** 2 - 4 * a * c
if d < 0:
    """"работа с комлексными значениями дискриминанта"""
    d = complex(d)
    print("x1 = ", ((-b + d**0.5) / (2*a)))
    print("x2 = ", ((-b - d**0.5) / (2*a)))
elif d == 0:
    """проверка на равные корни"""
    print("x = ", (-b / (2*a)))
elif d > 0:
    """работа с разными корнями"""
    print("x1 = ", float((-b + d ** 0.5) / (2*a)))
    print("x2 = ", float((-b - d ** 0.5) / (2*a)))
